---
title: EnergyAnalysisDetailModelOptions
classe: Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# EnergyAnalysisDetailModelOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `EnergyModelType EnergyModelType { get; set; }` | `energyAnalysisDetailModelOptions.EnergyModelType` | EnergyModelType |
| `Boolean ExportMullions { get; set; }` | `energyAnalysisDetailModelOptions.ExportMullions` | Boolean |
| `Boolean IncludeShadingSurfaces { get; set; }` | `energyAnalysisDetailModelOptions.IncludeShadingSurfaces` | Boolean |
| `Boolean IsValidObject { get; }` | `energyAnalysisDetailModelOptions.IsValidObject` | Boolean |
| `Boolean SimplifyCurtainSystems { get; set; }` | `energyAnalysisDetailModelOptions.SimplifyCurtainSystems` | Boolean |
| `EnergyAnalysisDetailModelTier Tier { get; set; }` | `energyAnalysisDetailModelOptions.Tier` | EnergyAnalysisDetailModelTier |
| `Void Dispose()` | `energyAnalysisDetailModelOptions.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```